{
  "grammar": [
    {"id":"yg001","sentence":"For a long time, scientists ---- aware that the Earth's atmosphere is not static, but is in constant motion, producing areas of ever-changing pressure around the globe, but from 1700 onward, scientists ---- to discover how and why large-scale atmospheric movements occur.","options":["had been / have begun","would have been / had begun","have been / began","would be / were beginning","were / would have begun"],"answer":2,"topic":"tense","level":"B2","exam":"YDS","year":"2018"},
    {"id":"yg002","sentence":"Science ---- our every question, but it ---- humanity's best tool yet for tackling our greatest challenges.","options":["may not answer / had remained","must not answer / has remained","should not answer / will remain","cannot answer / remained","might not answer / remains"],"answer":4,"topic":"modal","level":"B2","exam":"YDS","year":"2018"},
    {"id":"yg003","sentence":"Five of the Solomon Islands ---- whole by rising sea levels, ---- a glimpse into the future of other low-lying nations, such as the Netherlands and Italy.","options":["are being swallowed / having offered","had been swallowed / being offered","will be swallowed / having been offered","were swallowed / offered","have been swallowed / offering"],"answer":4,"topic":"tense","level":"B2","exam":"YDS","year":"2018"},
    {"id":"yg004","sentence":"Research ---- media has primarily examined the effects of media on children ---- a developmental perspective with a psychological focus on the correlation or causal variables between the media and children's behaviour.","options":["against / under","on / from","through / across","in / beyond","at / over"],"answer":1,"topic":"preposition","level":"B2","exam":"YDS","year":"2018"},
    {"id":"yg005","sentence":"Identifying the specific effects of beneficial microbes that thrive ---- the surface of our bodies and deep ---- our tissues, researchers are gaining a new view of how our bodies function.","options":["at / over","in / along","by / down","on / within","from / through"],"answer":3,"topic":"preposition","level":"B2","exam":"YDS","year":"2018"},
    {"id":"yg006","sentence":"Most cheesemakers believe that the brilliant nuances of flavour found in raw milk, with its naturally present 'good' bacteria, simply cannot be duplicated in a pasteurised milk cheese ---- some well-respected cheeses, including British Stilton, are made only from pasteurised milk.","options":["now that","after","although","because","only if"],"answer":2,"topic":"conjunction","level":"B2","exam":"YDS","year":"2018"},
    {"id":"yg007","sentence":"Surprisingly, the symbol for zero emerged later than the concepts for other numbers, and ---- the Babylonians used a symbol for zero, it was merely a placeholder and not used for computational purposes.","options":["just as","as if","in case","because","even though"],"answer":4,"topic":"conjunction","level":"B2","exam":"YDS","year":"2018"},
    {"id":"yg008","sentence":"Studies have found that the effects of a cup of coffee or a glass of cola are noticeable after just 10 minutes ---- the peak caffeine concentration in the blood occurs after 45 minutes.","options":["since","but","provided that","as long as","unless"],"answer":1,"topic":"conjunction","level":"B2","exam":"YDS","year":"2018"},
    {"id":"yg009","sentence":"Animals are hunted by humans ---- for their meat ---- for parts of their bodies that are used to create medicines, clothes, and jewellery.","options":["neither / nor","such / that","not only / but also","the more / the more","as / as"],"answer":2,"topic":"conjunction","level":"B2","exam":"YDS","year":"2018"},
    {"id":"yg010","sentence":"---- its notoriety as a naval weapon, the first modern torpedo was developed in landlocked Austria, or rather in what was then the Austrian Empire stretching down to the Adriatic.","options":["Along with","In terms of","Despite","Due to","Instead of"],"answer":2,"topic":"preposition","level":"B2","exam":"YDS","year":"2018"},
    {"id":"yg011","sentence":"For the first time, doctors ---- that temporarily opening the protective barrier of the human brain ---- to boost the delivery of cancer medication to brain tumours.","options":["are showing / helped","have shown / helps","showed / is helping","will have shown / was helping","will be showing / has been helping"],"answer":1,"topic":"tense","level":"B2","exam":"YDS","year":"2019"},
    {"id":"yg012","sentence":"The Martian atmosphere is so thin, and the planet's temperature so low that liquid water ---- there, and if it ever did in the past, conditions ---- very different.","options":["might not have existed / were to be","could not exist / may be","would not exist / can be","cannot exist / must have been","must not exist / should have been"],"answer":3,"topic":"modal","level":"B2","exam":"YDS","year":"2019"},
    {"id":"yg013","sentence":"A tsunami damaged emergency generators that ---- power to keep the nuclear reactors at Fukushima in Japan cool; however, the earthquake ---- to the tsunami also caused the cooling systems to fail.","options":["should provide / to lead","could have provided / to have led","would have provided / leading","must have provided / having led","might provide / led"],"answer":2,"topic":"modal","level":"B2","exam":"YDS","year":"2019"},
    {"id":"yg014","sentence":"---- the 17th century, committed Anglicans produced a steady flow of religious and devotional literature that aimed to inspire holiness ---- readers.","options":["By / about","During / through","Throughout / among","From / against","Across / over"],"answer":2,"topic":"preposition","level":"B2","exam":"YDS","year":"2019"},
    {"id":"yg015","sentence":"The word adolescence is Latin ---- origin, derived from the verb adolescere, which means 'to grow ---- adulthood'.","options":["through / on","from / to","at / beyond","in / into","with / over"],"answer":3,"topic":"preposition","level":"B2","exam":"YDS","year":"2019"},
    {"id":"yg016","sentence":"---- immigrants to North America's new colonies were primarily British in the 17th and 18th centuries, significant numbers of people of other nationalities also established a presence in the Americas.","options":["Because","While","As long as","Provided that","Once"],"answer":1,"topic":"conjunction","level":"B2","exam":"YDS","year":"2019"},
    {"id":"yg017","sentence":"Not much had been accomplished with the phenomena of magnetism and static ---- the Chinese began to use the magnetic compass for navigation around 1000 AD.","options":["in case","while","until","if","as soon as"],"answer":2,"topic":"conjunction","level":"B2","exam":"YDS","year":"2019"},
    {"id":"yg018","sentence":"Liquid water covers more than two-thirds of the Blue Planet's surface, ---- exactly how it got there has always been puzzling.","options":["so","instead","but","otherwise","as"],"answer":2,"topic":"conjunction","level":"B2","exam":"YDS","year":"2019"},
    {"id":"yg019","sentence":"Personality is ---- a crucial aspect of psychology ---- every main branch of psychological research has attempted to contribute to the existing knowledge in this area.","options":["such / that","whether / or","as much / as","the more / the more","neither / nor"],"answer":0,"topic":"conjunction","level":"B2","exam":"YDS","year":"2019"},
    {"id":"yg020","sentence":"Having a geopolitical significance ---- its unique aspect of dividing two continents, the Bosphorus stands among distinguished landmarks of Istanbul.","options":["similar to","thanks to","in place of","in spite of","contrary to"],"answer":1,"topic":"preposition","level":"B2","exam":"YDS","year":"2019"}
  ],
  "sentence_completion": [
    {"id":"ysc01","sentence":"----, but the creation of genetic techniques to safely halt or reverse age-related conditions in humans has so far proven improbable.","options":["Some researchers have doubts whether a new genetic technique could be developed as a first step towards the medical world's fabled 'elixir of youth'","It has long been known that manipulating certain genes in an organism can slow ageing and extend its lifespan","More proof will be needed before new genetic treatments using stem cells can be promoted as the key to turning back the clock on old age","Ageing of the body is a dynamic process, as often reported by a number of researchers","The efficacy of new methods utilised to prevent ageing is still questionable"],"answer":1,"level":"B2","exam":"YDS","year":"2018"},
    {"id":"ysc02","sentence":"Because bodybuilders exert large amounts of energy, ----.","options":["they are judged on the physical appearance of their muscles and encouraged to focus on body image","they try to achieve the body type that will help them be effective competitors in their sport","bodybuilding is the development of the physique through exercise, often for competitive exhibition","their metabolism generally requires more calories per day than the average person","bodybuilding is an activity that includes weight training in order to build muscle mass"],"answer":3,"level":"B2","exam":"YDS","year":"2018"},
    {"id":"ysc03","sentence":"While people can generally cough voluntarily, ----.","options":["infectious viruses can be easily transmitted between individuals through coughing","most people cough once or twice an hour during the day to clear irritants off the airway","environmental pollutants, such as cigarette smoke and dust, can also cause a cough","the cough that accompanies a cold usually lasts one to two weeks","vitamins and minerals may be helpful in treating conditions that lead to coughs"],"answer":2,"level":"B2","exam":"YDS","year":"2018"},
    {"id":"ysc04","sentence":"When mental disorders, physical conditions, and functional decline co-occur, ----.","options":["older adults face a greatly increased risk of hospitalisation and placement in long-term care facilities","some older adults have been found to be relatively active well into their 80s and 90s","it is important to note that older adults vary substantially in terms of their physical and mental health","physical decline is associated with causing a number of mental disorders among older adults","mental health problems such as depression are not a natural consequence of growing older"],"answer":0,"level":"B2","exam":"YDS","year":"2018"},
    {"id":"ysc05","sentence":"Unless there are substantial changes in the ways that humans affect ecosystems, ----.","options":["we have already caused permanent losses in global biodiversity","our knowledge of Earth's species is still incomplete","there could be as many as 30-50 million species on Earth","there will be much larger losses of biodiversity in the near future","the scale by which we consider biodiversity ranges from local to global"],"answer":3,"level":"B2","exam":"YDS","year":"2018"},
    {"id":"ysc06","sentence":"----, our very lives depend on it to sustain agriculture and to keep our bodies healthy.","options":["Since scientists have long struggled to comprehend the complexities of the weather","Just as the Earth's atmosphere would remain stagnant without weather","While cold weather might cause us discomfort or even more severe health conditions","Given that humanity has, indeed, changed the weather","If predicting the weather is still, in many ways, a haphazard occupation"],"answer":2,"level":"B2","exam":"YDS","year":"2018"},
    {"id":"ysc07","sentence":"----, the nations of Europe raced to colonise the continent.","options":["Given that almost all European interaction with Africa took place along the coasts until the 18th century","Because African responses to the challenge of European imperialism were complex","Even if colonial administrations enticed or coerced Africans into producing goods for export","When technological advances made Africa's interior readily accessible in the late 19th century","Despite several factors that drove the European scramble for Africa in the 18th century"],"answer":3,"level":"B2","exam":"YDS","year":"2018"},
    {"id":"ysc08","sentence":"----, the Romans became the first major society to wear seasonal clothing.","options":["Although Romans were very careful about the way they dressed","As most of what we know about Roman clothing comes from written sources","Because their empire grew so great and took them into very different climates","Even if Romans made warm winter boots and the first known raincoat","Whereas wealthy Romans had slaves to help choose their clothing"],"answer":2,"level":"B2","exam":"YDS","year":"2018"},
    {"id":"ysc09","sentence":"----, the ethnic characteristics and traditions of the Balkan Peninsula's food culture have been well preserved.","options":["Provided that it displays both Asian and western European influences","Even if meat might not have played a central role in the past","Even though the eastern influence has been very strong in the last several centuries","As long as its food culture is shaped by the historic, social and climatic elements","While the use of numerous spices constitutes the basics of its cuisine"],"answer":2,"level":"B2","exam":"YDS","year":"2018"},
    {"id":"ysc10","sentence":"The Sung dynasty Chinese (AD 960-1279) had the technology to make rockets, ----.","options":["so the first European picture of a rocket was made in 1400","thus it was occasionally used as a weapon by Europeans","because the earliest European recipe for black powder appeared in 1265","but there is no definitive evidence that they did so","as the origin of the rocket is shrouded in mystery"],"answer":3,"level":"B2","exam":"YDS","year":"2018"},
    {"id":"ysc11","sentence":"As the Dakota tribes along the Minnesota River in the US were fed up with settlers flooding into their territory, ----.","options":["they were less powerful and thus failed to defeat the settlers","the settlers were determined to fight against the Dakota tribes","they decided to respond with attacks to push the settlers off their reservation","the settlers reached an agreement on the territorial issues with the Dakota tribes","the new settlers of Dakota started a riot to rebel against the tribal chiefs"],"answer":2,"level":"B2","exam":"YDS","year":"2019"},
    {"id":"ysc12","sentence":"Because we are bombarded with so much information and misinformation about what might cause cancer, ----.","options":["it is often hard to separate myth from reality","it affects every one of us in the same way","the chance of being diagnosed is one in two","there are some things we can do to reduce our risk of getting cancer","the extent of public confusion was exposed in a survey last year"],"answer":0,"level":"B2","exam":"YDS","year":"2019"},
    {"id":"ysc13","sentence":"For a long time, punishment was viewed as a useful child-rearing tool, ----.","options":["since children seek role models who they can observe and imitate to learn complex social behaviours","furthermore, it evokes strong negative feelings in a child that he or she relates to the person applying it","therefore, punishment draws attention to the negative behaviour rather than the desired alternative","yet, it is now recognised that it generally does not lead to the desired behavioural outcome for children","hence, parents punishing their children for an inappropriate action are not providing an example of the correct behaviour"],"answer":3,"level":"B2","exam":"YDS","year":"2019"},
    {"id":"ysc14","sentence":"While each researcher has their own way of analysing and interpreting animal remains, ----.","options":["it must be remembered that sample size and preservation quality ultimately influence the outcome","animal remains aid in the interpretation of ancient resource choices","it is fundamental to determine the locations and social complexity of archaeological sites","animal remains can be used to provide information about a variety of issues in the study of societies","some methods, terms and analytical tools are considered standard"],"answer":4,"level":"B2","exam":"YDS","year":"2019"},
    {"id":"ysc15","sentence":"Even though animal behaviourists have traditionally avoided linking human emotions, such as grief, with responses by animals, ----.","options":["grief in animals may take forms that are difficult for humans to recognise as mourning","observations suggest that the ways in which we mourn might be uniquely human","a growing body of evidence shows that species ranging from dolphins to ducks mourn the passing of relatives","research on grief in wild monkeys that live in social units has been surprisingly limited so far","we think that humans are the only species that grieves over the loss of loved ones"],"answer":2,"level":"B2","exam":"YDS","year":"2019"},
    {"id":"ysc16","sentence":"----, language, as a complicated phenomenon of the human mind, does not seem to be restricted to a single region in the brain.","options":["If neurolinguists want to examine the functioning of the human brain in more detail","Even if certain tasks are fulfilled through coordination among neurons","Although it is localised mainly on the left side of the brain","As it is a concrete manifestation of the human mind","When the brain is overwhelmed with long and complex sentences"],"answer":2,"level":"B2","exam":"YDS","year":"2019"},
    {"id":"ysc17","sentence":"----, someone who is successful in several fields is often called a Renaissance man or Renaissance woman.","options":["In order to better understand the masterpieces of the brilliant Renaissance artists such as Michelangelo and Raphael","While the Renaissance affected every area of human activity and knowledge, from art to zoology","Because the Renaissance produced individuals with a wide range of interests who excelled in a number of different areas","Although most historians shared the view of the period as a rebirth after the darkness of the Middle Ages","After science advanced when Renaissance humanists discovered and spread ancient works on mathematics, medicine, and other topics"],"answer":2,"level":"B2","exam":"YDS","year":"2019"},
    {"id":"ysc18","sentence":"Peer pressure is what causes people to do things that are popular in order to fit in with others, ----.","options":["while middle school students influence each other to a great extent","however, peers are the people who are of similar age, such as classmates","in other words, some individuals resist peer pressure and prioritise their own personal views","so it can be a very powerful driving force in the lives of adolescents","as psychologists use positive peer pressure as a method to change a child's behaviour"],"answer":3,"level":"B2","exam":"YDS","year":"2019"},
    {"id":"ysc19","sentence":"According to skeletal therapists, it is vital that women strengthen their bodies in their 40s, ----.","options":["so a considerable number of women do not know very well how to maintain their bone health","as bone density starts to gradually decrease, leaving the bones fragile during this period","but hunched shoulders and poor posture can lead to a range of health issues in the old age","as long as muscles work optimally to support the skeleton and the body is positioned correctly","even though bad posture is known to give them an awkward look and might lead to serious ailments in time"],"answer":1,"level":"B2","exam":"YDS","year":"2019"},
    {"id":"ysc20","sentence":"Fast food has emerged as one of the biggest enemies of health, especially for children, ----.","options":["thus its high consumption makes sense when the prices are considered","provided that the most common cause of obesity is the wide availability of fast food","while people are highly concerned about the nutritional deficiency of foods like burgers","so the fast food industry has received a lot of critical attention in recent years","as many fast food restaurants have started to provide healthier alternatives such as salads"],"answer":3,"level":"B2","exam":"YDS","year":"2019"}
  ]
}
